In [101]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])
df_altered = df.copy()

In [68]:
df_salary = df_altered[pd.notna(df_altered['salary_year_avg'])].copy()
def projected_salary(salary):
    return salary * 1.03
df_salary['salary_year_inflated'] = df_salary['salary_year_avg'].apply(projected_salary)

In [ ]:
df_salary[['salary_year_inflated', 'salary_year_avg']]

In [ ]:
df_salary2 = df_altered[pd.notna(df_altered['salary_year_avg'])].copy()
df_salary2['salary_year_inflated'] = df_salary2['salary_year_avg'].apply( lambda salary: salary * 1.03)
df_salary2[['salary_year_inflated', 'salary_year_avg']]

In [ ]:
df_salary3 = df_altered[pd.notna(df_altered['salary_year_avg'])].copy()
df_salary3['salary_year_inflated'] = df_salary3['salary_year_avg'] * 1.03
df_salary3[['salary_year_inflated', 'salary_year_avg']]

In [ ]:
#string to list
import ast
ast.literal_eval(df_altered['job_skills'][1]) # type(ast.literal_eval(df_altered['job_skills'][1])) type list

In [ ]:
df_altered['job_skills'][1] # type(df_altered['job_skills'][1]) - str

In [86]:
def clean_list(skills):
    if pd.notna(skills):
        return ast.literal_eval(skills)
df_altered['job_skills'] = df_altered['job_skills'].apply(clean_list)

In [98]:
#alternative to def clean_list
df_altered['job_skills'] = df_altered['job_skills'].apply(lambda skil: ast.literal_eval(skil) if pd.notna(skil) else skil)

In [115]:
# % priklauso nuo pareigu
def projected_salar(row):
    if 'Senior' in row['job_title_short']:
        return 1.05 * row['salary_year_avg']
    else: 
        return 1.03 * row['salary_year_avg']
df_salary4 = df_altered[pd.notna(df_altered['salary_year_avg'])].copy()

df_salary4['job_salary_inflated'] = df_salary4.apply(projected_salar, axis=1)

# alternatyva df_salary4['salary_year_inflated'] = df_salary4.apply(lambda row: 1.05 * row['salary_year_avg'] if 'Senior' in row['job_title_short'] else 1.03 * row['salary_year_avg'], axis=1)

In [124]:
df_salary4[['job_title_short', 'salary_year_avg', 'job_salary_inflated']]

       job_title_short  salary_year_avg  job_salary_inflated
28      Data Scientist         109500.0            112785.00
77       Data Engineer         140000.0            144200.00
92       Data Engineer         120000.0            123600.00
100     Data Scientist         228222.0            235068.66
109       Data Analyst          89000.0             91670.00
...                ...              ...                  ...
785624   Data Engineer         139216.0            143392.48
785641   Data Engineer         150000.0            154500.00
785648  Data Scientist         221875.0            228531.25
785682  Data Scientist         157500.0            162225.00
785692  Data Scientist         157500.0            162225.00

[22003 rows x 3 columns]